Revit 2027 API
MEPSystemType.LinePatternId Property
 Indicates the line pattern id that should override the line pattern id for all components in the system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId LinePatternId { get; set; }
Public Property LinePatternId As ElementId
	Get
	Set
public:
property ElementId^ LinePatternId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member LinePatternId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
MEPSystemType Class
Autodesk.Revit.DB Namespace